//HERC02C JOB (1),'CARGA CUENTAS',CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1),
//            USER=HERC02,PASSWORD=CUL8TR
//* Crea el dataset HERC02.BANCO.CUENTAS con datos de prueba
//* (simula el fichero que "otro departamento" deja cada noche)
//BORRA   EXEC PGM=IEFBR14
//DD1      DD DSN=HERC02.BANCO.CUENTAS,DISP=(MOD,DELETE,DELETE),
//            UNIT=SYSDA,SPACE=(TRK,(1,1))
//CARGA   EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=A
//SYSIN    DD DUMMY
//SYSUT2   DD DSN=HERC02.BANCO.CUENTAS,DISP=(NEW,CATLG),
//            UNIT=3350,VOL=SER=PUB000,SPACE=(TRK,(1,1)),
//            DCB=(RECFM=F,LRECL=80,BLKSIZE=80)
//SYSUT1   DD *
1000000001ANA GARCIA          000450000A
1000000002LUIS MARTINEZ       001230050C
1000000003MARIA LOPEZ         000085075A
1000000004JOSE FERNANDEZ      002500000A
1000000005CARMEN RUIZ         000199999C
1000000006PEDRO SANCHEZ       000742010C
1000000007LUCIA TORRES        000032040A
1000000008MIGUEL DIAZ         001575025C
//
