//HERC02H JOB (1),'HOLA COBOL',CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//* Compila, monta y ejecuta un programa COBOL (proc COBUCLG)
//PASO1   EXEC COBUCLG
//COB.SYSIN DD *
       IDENTIFICATION DIVISION.
       PROGRAM-ID. HOLA.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77  WS-CONTADOR   PIC 9(2) VALUE 0.
       PROCEDURE DIVISION.
       INICIO.
           DISPLAY 'HOLA DESDE EL MAINFRAME MVS 3.8J'.
           PERFORM BUCLE 5 TIMES.
           DISPLAY 'FIN DEL PROGRAMA'.
           STOP RUN.
       BUCLE.
           ADD 1 TO WS-CONTADOR.
           DISPLAY 'ITERACION NUMERO ' WS-CONTADOR.
/*
//GO.SYSOUT DD SYSOUT=A
//
